{
  "presets": [
    {
      "name": "Software",
      "summary": "summary: Highly adaptable individual with strong communication skills and a passion for working in fast-paced environments. My background has honed my ability to work well in a team, and my collaborative mindset will be a valuable asset in a engineering role. Alongside my technical skills in Node.js, Express.js, SQL, MongoDB, Websocket, Docker, AWS... I am committed to delivering efficient and effective solutions to my team and clients.",
      "skills": "skills: Back-End:Node.js / Express.js Python / Django Linux MVC, TDD MySQL, MongoDB HTTP, HTTPS, WebSocket Front-End HTML, CSS, jQuery JavaScript, TypeScript , Cloud Service AWS EC2, RDS, S3, DevOps Docker Version Control Git, Github Testing Jest, Supertest Others C, Arduino",
      "experience": "project experience: BeatMatcher (Full Stack) The app connects songwriters with beatmakers, using tinder-like swapping with 30 secs music clips, allowing them to find the most suitable match for their next collaboration Utilized the socket.io framework for real-time messaging and notification and Multer for file uploads. Added in-app audio editing using Wavesurfer.js, allowing users to visually manipulate audio files within the application. Implemented a MySQL database on AWS RDS for user accounts, match requests and messages managＦＦement and utilized S3 for storage of files. Deployed the application on a Railway cloud server. Goals (Back-End API) The web app helps user reach their goals by visualising their working progress Developed a web app using Node.js, Express.js, MySQL, Passport.js, and Express-session. Collaborated with a front-end engineer to gather requirements and design the product, and created a fully specified REST API with detailed documentation for the team. Implemented user authentication and authorization using Passport.js and Express-session, and tested CRUD API endpoints with Postman. Deployed the API to an AWS RDS cloud server and solved cross-origin cookies sharing issues, ensuring seamless integration with the front-end.",
      "workexperience": "WORK EXPERIENCE: Music Producer 2018 – 2022  Led and operated a highly successful music production studio, OOPIG, which achieved over 1 million views on all streaming platforms. Led the transition of our studio's focus to Taiwanese hip-hop music production market, resulting in a 200% increase in revenue the following year.Boosted the local music tech community by authoring 100,000 plus viewed articles on music technology for blog platform DigiLog.",
      "education": "National Taiwan Normal University 2013 – 2018 Bachelor of Physics In 2015, I joined Professor Ivan Liu's technology art team as an intern, working with art relative programming language . we were selected for the 2015 Digital Art Performance Award. W skills: Arduino, Pure Data, Installation art",
      "jobTitle": "",
      "jobDescription": "",
      "companyProducts": "",
      "cvReference": "Dear Hiring Manager, I am writing to express my interest in the Backend engineer position at . As a former music company manger and an huge music enthusiast, I am excited to see that is using technology to uncover new possibilities for fans and artists. I understand the challenges of the music industry better than anyone and I am eager to solve these problems through software. This is an opportunity for me to put my expertise and passion into the work, and I hope to become a part of the development team to grow and work together to create a software that helps music professionals and audiences all over the world. I would like to briefly share my personal project, Beatmatcher, which showcases both my skills and passion in music and software development. With thousands of music and beats being released every day, I pondered how to match beatmakers with songwriters in the fastest way possible. Thus, I developed the Beatmatcher software that allows musicians to judge their preferences through a 30-second music clip and match each other through mutual admiration, leading to future collaborations. I built the backend program using node.js and MySQL and used websocket for real-time notifications and messaging technology, and AWS to cloud the service. Through this project, I have developed my ability to quickly learn new technologies and create innovative ideas, and I am confident that I will continue to make a positive impact on the music industry in the future. https://github.com/kurostanley/BeatMatcher Thank you for considering my application. I am eager to move onto the next stage and showcase my skills and enthusiasm for software development."
    },
    {
      "name": "Hp",
      "summary": "Highly adaptable individual with strong communication skills and a passion for working in fast- paced environments. I have a proven track record of excelling in the service industry, leveraging my expertise in music production and management. My background has honed my ability to work well in a team, and my collaborative mindset will be a valuable asset in a service-oriented role. I am committed to delivering exceptional customer experiences and ensuring client satisfaction.",
      "skills": "",
      "experience": "",
      "workexperience": "EXPERIENCE BARTENDER Pure Craft Bar and Kitchen | 2023 | Birmingham Personal achievement: Over £15000+ sale on December, familiar working in fast path environment and delivery best quality Introduce brewing process, highlight beer features to customers Experienced with Keg and Cask beer operations Familiar with cocktail, espresso machine and latte art MUSIC STUDIO MANAGER / PRODUCER OOPIG Music Production Studio | 2018 – 2022 | Taiwan Led and operated a highly successful music production studio, achieving over 1 million views on all streaming platforms. Successfully transitioned our studio's focus to the Taiwanese hip-hop music production market, resulting in a 200% increase in revenue the following year. Boosted the local music tech community by authoring 100,000+ viewed articles on music technology for the blog platform DigiLog.",
      "education": "National Taiwan Normal University 2013 – 2018 Bachelor of Physics In 2015, I joined Professor Ivan Liu's technology art team as an intern, working with art relative programming language . we were selected for the 2015 Digital Art Performance Award. W skills: Arduino, Pure Data, Installation art",
      "jobTitle": "",
      "jobDescription": "",
      "companyProducts": "",
      "cvReference": "Hi Alex Proudfoot, I hope this email finds you well. I came across the job opening at JuiceBox Store and am writing to express my interest in the position. My journey in the realm of taste commenced with specialty coffee and has since evolved, leading me to my current role at a craft beer bar. Delving into diverse culinary experiences, I've gained insights into the nuances of flavor, production processes, and beverage cultures. Sharing this knowledge with others brings me great joy. Over the past year, I've also delved into the world of natural wines, with a particular fascination for experimental winemaking methods. I am enthusiastic about bringing this passion to JuiceBox and sharing it with customers while growing alongside my colleagues. I am a team player who thrives in fostering a positive work atmosphere. Continuously honing my skills, I dedicate my off-hours to supplementing any knowledge gaps and seek guidance from colleagues when needed. I also enjoy exploring different bars to expand my understanding of diverse beverage cultures and service approaches. I am planning to relocate to Manchester in January and am eager to join the JuiceBox team. I hope to have the opportunity for a further interview to provide you with a more in-depth understanding of my qualifications. Best regards, Lin"
    },
    {
      "name": "Software TW",
      "summary": "作為一名後端工程師，我擅⻑使用 Node.js, SQL, nonSQL 等技術，開發高效穩定的Web應用程式。在過去的 幾年裡，我成功開發了兩個 Full Stack 應用，並在團隊中擔任核心開發⻆色。我對技術充滿熱情，不斷學習 新技術，並將所學應用於實際的開發工作中",
      "skills": "skills: Back-End:Node.js / Express.js Python / Django Linux MVC, TDD MySQL, MongoDB HTTP, HTTPS, WebSocket Front-End HTML, CSS, jQuery JavaScript, TypeScript , Cloud Service AWS EC2, RDS, S3, DevOps Docker Version Control Git, Github Testing Jest, Supertest Others C, Arduino",
      "experience": "BeatMatcher (Full Stack) DEMO 使用類 Tinder 的互動方式媒合歌手與音樂製作人，透過 30 秒的音樂片段配對，透過演算法幫助他們找到最 合適的合作對象 使用 socket.io 框架實現即時通知和通訊功能，並使用 Multer 框架進行文件上傳 添加了基於 Wavesurfer.js 框架實現線上音頻編輯功能，允許用戶在應用程式中直觀地操作音頻文件 利用 MySQL 資料庫實現了帳戶管理、匹配請求與消息管理的功能，並部署在 AWS RDS 上。使用 AWS S3 進行文件存儲將應用程式部署在 Railway 雲伺服器上 //// Goals (Back-End API) Github 於網頁中幫助用戶視覺化他們的工作進度以達成目標 使用 Node.js、Express.js、MySQL、Passport.js 和 Express-session 開發了網頁應用程式 與前端工程師合作，收集需求並設計產品，並為團隊創建了詳細的 REST API 文檔 使用 Passport.js 和 Express-session 實現用戶身份驗證和授權，並使用 Postman 測試 CRUD API 端點 將 API 部署到 AWS RDS 雲伺服器，並解決了跨源 cookie 共享問題，確保與前端的正常運作。",
      "workexperience": "咖啡師 @Fiori Manchester (英國) 2022 - 2024 建立庫存管理系統:利用 Google Sheets 結合 JavaScript，為公司訂製所需的進貨清單，提高工 作效率50%，並減少庫存錯誤80% 標準化製作流程:將各項飲品訂定標準化製作流程，將新員工培訓時間縮短30%，並提升工作效 率25% 卓越的顧客服務:提供卓越的顧客服務，與顧客互動並針對特色咖啡提供個性化建議，顧客回頭 率增加15% 數位行銷助理 @OOPIG studio (台灣) 2018 – 2022協助音樂製作工作室OOPIG進行數位行銷，該工作室在所有串流平台上共獲得超過 100 萬次觀看 領導工作室轉向台灣嘻哈音樂製作市場，並於次年增加收入約 200% 撰寫音樂科技文章於 DigiLog 平台，觀看次數超過 100,000 次，促進了台灣音樂科技社群的發展",
      "education": "國立台灣師範大學 2013 – 2018 物理學士 2015年，我以實習生的身份加入劉辰岫教授的科技藝術團隊，在職期間使用藝術相關的程式語言去協助創 作，並在2015年入選數位藝術表演獎。 技能: Arduino, Pure Data, Installation art",
      "jobTitle": "",
      "jobDescription": "",
      "companyProducts": "",
      "cvReference": ""
    }
  ]
}
